assembly/vim.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-06-03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>使用GVIM阅读MASM代码</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"/><link rel="stylesheet" href="/css/site.css"/>
</head>
<body>
<div id="preamble" class="status">
<nav class="site-nav"><a class="brand" href="/">Jingtao&nbsp;Xu</a><span class="nav-links"><a href="/about/about.html">About</a><a href="/#services">Work</a><a href="/writing.html">Writing</a><a href="/proof.html">Proof</a><a class="nav-cta" href="/contact.html">Connect</a></span></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">使用GVIM阅读MASM代码</h1>
</header><div id="outline-container-org80bec1f" class="outline-2">
<h2 id="org80bec1f">说明</h2>
<div class="outline-text-2" id="text-org80bec1f">
<p>
作者个人收集整理的VIM配置文件可在 <a href="./vim/vimset.zip">这里</a> 下载，它仅做示例之用，您可以据此修改以满足自己的需求。
您还需要有grep,ctags等外部程序于系统路径中，并最好安装有cygwin。
</p>

<p>
在阅读下面的示例前，作者假设您已经配置好了系统环境，并在源代码的目录使用作者
修改的ctags程序生成了tags文件。
</p>
</div>
</div>
<div id="outline-container-org49580b9" class="outline-2">
<h2 id="org49580b9">所需程序</h2>
<div class="outline-text-2" id="text-org49580b9">
<p>
<a href="http://www.vim.org/download.php">Gvim</a> <a href="./vim/ctags-5.2-1.zip">Ctags</a> <a href="./vim/grep.zip">grep</a> <a href="http://www.cygwin.com/">cygwin</a> <a href="./vim/vimset.zip">vimset</a>
</p>
</div>
</div>
<div id="outline-container-org5e6d3d4" class="outline-2">
<h2 id="org5e6d3d4">示例</h2>
<div class="outline-text-2" id="text-org5e6d3d4">
<ol class="org-ol">
<li>如何查阅MASM代码及C代码中的所有函数和全局变量：</li>
</ol>
<blockquote>
<p>
使用命令:Tlist（需要当前目录下有tags文件）。
</p>
</blockquote>

<ol class="org-ol">
<li>当看到调用另一个子程序的代码时，如何跳转到这个子程序处：</li>
</ol>
<blockquote>
<p>
光标移动到子程序名处，按Ctrl-]键，返回可按Ctrl-O或ctrl-T。
</p>
</blockquote>

<ol class="org-ol">
<li>如何在一个程序间跳来跳去：</li>
</ol>
<blockquote>
<p>
利用VIM的书签功能。在某行上按mx添加一个名为x的书签（其中x为26个英文字母中的一个）,
当想返回书签处时，只需按下"x即可。
</p>
</blockquote>

<ol class="org-ol">
<li>如何重复执行一些命令：</li>
</ol>
<blockquote>
<p>
　  利用VIM的宏记录功能，按下qx(x为26个英文字母中的一个）开始记录命令，
    当完成需要记录的命令后，再按q结束宏记录。以后当你想重复执行这些命令
    时只需要按下@x即可。
</p>
</blockquote>
<ol class="org-ol">
<li>如何知道一个子函数在哪里被调用过：</li>
</ol>
<blockquote>
<p>
执行命令:grep procname *.asm *.inc　，然后执行:cl命令即可看到当前
目录下所有asm,inc文件中调用procname的地方，执行命令:cc n
可跳到第n个出现procname的地方。
</p>
</blockquote>

<ol class="org-ol">
<li>如何在各个BUFFER间转换：</li>
</ol>
<blockquote>
<p>
可以使用命令:bn和:bp，作者的配置文件使用了快捷键F11和Shift-F11来
替代它们。
</p>
</blockquote>

<ol class="org-ol">
<li>如何同时注释掉数行代码：</li>
</ol>
<blockquote>
<p>
使用v命令选择需要注释的多行代码，然后选择F6注释掉它们，或者选择Shift-F6
取消注释。
</p>
</blockquote>

<ol class="org-ol">
<li>如何查看到一个常量，变量或函数的定义：</li>
</ol>
<blockquote>
<p>
光标移动到对应的单词处，按[i键，如果显示错误或者未显示完整，可按F4键，
并从列表中选择您想查看的内容（这需要您配置好<sub>gvimrc中的绝对路径</sub>）。
</p>
</blockquote>

<ol class="org-ol">
<li>如何启用代码自动完成功能：</li>
</ol>
<blockquote>
<p>
执行菜单项“工具&ndash;&gt;Word Completion”。
</p>
</blockquote>

<ol class="org-ol">
<li>如何在VIM中调用WINDOWS下的帮助文件。</li>
</ol>
<blockquote>
<ol class="org-ol">
<li>使用菜单项winhelp增加HLP帮助文件，在需要帮助的单词(通常是API或其它WINDOWS
数据结构和常量定义)上按"Ctrl-k"或"Ctrl-l"。</li>
<li>执行程序mh.exe，选择相应的CHM或COL文件，可查看mh.txt文件了解mh.exe的使用方法。
然后在需要帮助的单词上按"mK"。</li>
</ol>
</blockquote>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="site-footer"><p>Remote · UTC+8 · fluent English / 中文</p><p><a href="mailto:dev@jingtao.net">dev@jingtao.net</a> · <a href="https://cal.com/jingtaoxu">Book a call</a> · <a href="https://github.com/jingtao-net">github.com/jingtao-net</a></p><p class="fineprint">© Jingtao Xu</p></footer>
</div>
</body>
</html>
